### [ env/poc ] terraform plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_private_dns_zone.monitor-ampls-pen-dns-zone will be created
  + resource "azurerm_private_dns_zone" "monitor-ampls-pen-dns-zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.monitor.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "faspo-poc-net-rg"

      + soa_record (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.monitor-ampls-zone-vnet-link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "monitor-ampls-zone-vnet-link" {
      + id                    = (known after apply)
      + name                  = "faspo-poc-monitor-ampls-pen-dns-zone-vnet-link"
      + private_dns_zone_name = "privatelink.monitor.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "faspo-poc-net-rg"
      + virtual_network_id    = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/virtualNetworks/faspo-poc-vnet"
    }

  # azurerm_private_endpoint.monitor-ampls-pen will be created
  + resource "azurerm_private_endpoint" "monitor-ampls-pen" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "faspo-poc-monitor-ampls-pen-nic"
      + id                            = (known after apply)
      + location                      = "germanywestcentral"
      + name                          = "faspo-poc-monitor-ampls-pen"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "faspo-poc-net-rg"
      + subnet_id                     = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/virtualNetworks/faspo-poc-vnet/subnets/faspo-poc-vnet-infra-subnet"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "faspo-poc-monitor-ampls-pen-dns-zone-group"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "monitor-ampls-pen-connection"
          + private_connection_resource_id = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Insights/privateLinkScopes/faspo-poc-monitor-ampls"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "azuremonitor",
            ]
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
